; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-u-6)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	satellite7 - satellite
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	infrared3 - mode
	infrared1 - mode
	thermograph2 - mode
	spectrograph0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star2 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Planet18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
	Star23 - direction
	Phenomenon24 - direction
	Planet25 - direction
	Star26 - direction
	Star27 - direction
	Phenomenon28 - direction
	Star29 - direction
	Phenomenon30 - direction
	Star31 - direction
	Star32 - direction
	Star33 - direction
	Planet34 - direction
	Phenomenon35 - direction
	Planet36 - direction
	Star37 - direction
	Planet38 - direction
	Star39 - direction
	Star40 - direction
	Planet41 - direction
	Phenomenon42 - direction
	Star43 - direction
	Planet44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Star47 - direction
	Star48 - direction
	Phenomenon49 - direction
	Star50 - direction
	Phenomenon51 - direction
	Planet52 - direction
	Planet53 - direction
	Planet54 - direction
	Star55 - direction
	Star56 - direction
	Planet57 - direction
	Planet58 - direction
	Planet59 - direction
	Planet60 - direction
	Planet61 - direction
	Phenomenon62 - direction
	Phenomenon63 - direction
	Phenomenon64 - direction
	Planet65 - direction
	Phenomenon66 - direction
	Phenomenon67 - direction
	Phenomenon68 - direction
	Planet69 - direction
	Planet70 - direction
	Phenomenon71 - direction
	Planet72 - direction
	Phenomenon73 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star33)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared1)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star31)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared1)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star2)
	(supports instrument9 infrared1)
	(supports instrument9 infrared3)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
	(supports instrument10 thermograph2)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 Star2)
	(supports instrument11 thermograph2)
	(supports instrument11 infrared1)
	(supports instrument11 infrared3)
	(calibration_target instrument11 Star1)
	(supports instrument12 spectrograph0)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet38)
	(supports instrument13 spectrograph0)
	(supports instrument13 infrared1)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 GroundStation3)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet65)
	(supports instrument14 infrared3)
	(supports instrument14 infrared1)
	(calibration_target instrument14 Star1)
	(supports instrument15 infrared3)
	(calibration_target instrument15 GroundStation3)
	(supports instrument16 infrared1)
	(supports instrument16 spectrograph0)
	(supports instrument16 infrared3)
	(calibration_target instrument16 GroundStation3)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon28)
	(supports instrument17 infrared1)
	(supports instrument17 infrared3)
	(calibration_target instrument17 Star2)
	(supports instrument18 spectrograph0)
	(supports instrument18 thermograph2)
	(calibration_target instrument18 Star2)
	(supports instrument19 spectrograph0)
	(supports instrument19 thermograph2)
	(calibration_target instrument19 Star2)
	(on_board instrument17 satellite7)
	(on_board instrument18 satellite7)
	(on_board instrument19 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet17)
)
(:goal (and
	(pointing satellite3 Planet34)
	(pointing satellite4 Phenomenon12)
	(pointing satellite6 Planet41)
	(pointing satellite7 Star6)
	(have_image Planet4 thermograph2)
	(have_image Planet5 spectrograph0)
	(have_image Star6 thermograph2)
	(have_image Star7 infrared3)
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 infrared1)
	(have_image Star10 infrared3)
	(have_image Planet11 infrared3)
	(have_image Phenomenon13 infrared3)
	(have_image Phenomenon14 infrared3)
	(have_image Star15 thermograph2)
	(have_image Phenomenon16 spectrograph0)
	(have_image Planet17 infrared1)
	(have_image Planet18 infrared3)
	(have_image Planet20 spectrograph0)
	(have_image Planet21 spectrograph0)
	(have_image Planet22 spectrograph0)
	(have_image Phenomenon24 infrared1)
	(have_image Planet25 spectrograph0)
	(have_image Star26 infrared1)
	(have_image Star27 infrared3)
	(have_image Phenomenon28 spectrograph0)
	(have_image Star29 infrared3)
	(have_image Phenomenon30 thermograph2)
	(have_image Star31 infrared3)
	(have_image Star32 infrared1)
	(have_image Star33 infrared3)
	(have_image Planet34 thermograph2)
	(have_image Phenomenon35 spectrograph0)
	(have_image Planet36 infrared1)
	(have_image Star37 thermograph2)
	(have_image Planet38 spectrograph0)
	(have_image Star39 infrared1)
	(have_image Star40 spectrograph0)
	(have_image Planet41 infrared1)
	(have_image Phenomenon42 infrared3)
	(have_image Star43 infrared1)
	(have_image Planet44 spectrograph0)
	(have_image Phenomenon45 thermograph2)
	(have_image Phenomenon46 infrared1)
	(have_image Star47 spectrograph0)
	(have_image Star48 infrared3)
	(have_image Star50 infrared1)
	(have_image Planet52 infrared1)
	(have_image Planet53 spectrograph0)
	(have_image Planet54 thermograph2)
	(have_image Star55 infrared3)
	(have_image Star56 infrared3)
	(have_image Planet57 infrared3)
	(have_image Planet58 spectrograph0)
	(have_image Planet59 spectrograph0)
	(have_image Planet60 thermograph2)
	(have_image Planet61 infrared1)
	(have_image Phenomenon63 infrared1)
	(have_image Phenomenon64 infrared3)
	(have_image Planet65 thermograph2)
	(have_image Phenomenon66 infrared3)
	(have_image Phenomenon67 infrared3)
	(have_image Phenomenon68 infrared3)
	(have_image Planet69 thermograph2)
	(have_image Planet70 thermograph2)
	(have_image Phenomenon71 infrared1)
	(have_image Planet72 infrared3)
	(have_image Phenomenon73 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 68
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 68
3. (turn_to satellite0 star0 star33)
   deleted: (pointing satellite0 star33)
   added: (pointing satellite0 star0)
   goals met: 0 of 68
4. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 68
5. (turn_to satellite0 phenomenon13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 68
6. (take_image satellite0 phenomenon13 instrument0 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 1 of 68
7. (turn_to satellite0 phenomenon14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 68
8. (take_image satellite0 phenomenon14 instrument0 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 2 of 68
9. (turn_to satellite0 phenomenon24 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon24)
   goals met: 2 of 68
10. (take_image satellite0 phenomenon24 instrument0 infrared1)
   added: (have_image phenomenon24 infrared1)
   goals met: 3 of 68
11. (turn_to satellite0 phenomenon42 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 phenomenon42)
   goals met: 3 of 68
12. (take_image satellite0 phenomenon42 instrument0 infrared3)
   added: (have_image phenomenon42 infrared3)
   goals met: 4 of 68
13. (turn_to satellite0 phenomenon46 phenomenon42)
   deleted: (pointing satellite0 phenomenon42)
   added: (pointing satellite0 phenomenon46)
   goals met: 4 of 68
14. (take_image satellite0 phenomenon46 instrument0 infrared1)
   added: (have_image phenomenon46 infrared1)
   goals met: 5 of 68
15. (turn_to satellite0 phenomenon63 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon63)
   goals met: 5 of 68
16. (take_image satellite0 phenomenon63 instrument0 infrared1)
   added: (have_image phenomenon63 infrared1)
   goals met: 6 of 68
17. (turn_to satellite0 phenomenon64 phenomenon63)
   deleted: (pointing satellite0 phenomenon63)
   added: (pointing satellite0 phenomenon64)
   goals met: 6 of 68
18. (take_image satellite0 phenomenon64 instrument0 infrared3)
   added: (have_image phenomenon64 infrared3)
   goals met: 7 of 68
19. (turn_to satellite0 phenomenon66 phenomenon64)
   deleted: (pointing satellite0 phenomenon64)
   added: (pointing satellite0 phenomenon66)
   goals met: 7 of 68
20. (take_image satellite0 phenomenon66 instrument0 infrared3)
   added: (have_image phenomenon66 infrared3)
   goals met: 8 of 68
21. (turn_to satellite0 phenomenon67 phenomenon66)
   deleted: (pointing satellite0 phenomenon66)
   added: (pointing satellite0 phenomenon67)
   goals met: 8 of 68
22. (take_image satellite0 phenomenon67 instrument0 infrared3)
   added: (have_image phenomenon67 infrared3)
   goals met: 9 of 68
23. (turn_to satellite0 phenomenon68 phenomenon67)
   deleted: (pointing satellite0 phenomenon67)
   added: (pointing satellite0 phenomenon68)
   goals met: 9 of 68
24. (take_image satellite0 phenomenon68 instrument0 infrared3)
   added: (have_image phenomenon68 infrared3)
   goals met: 10 of 68
25. (turn_to satellite0 phenomenon71 phenomenon68)
   deleted: (pointing satellite0 phenomenon68)
   added: (pointing satellite0 phenomenon71)
   goals met: 10 of 68
26. (take_image satellite0 phenomenon71 instrument0 infrared1)
   added: (have_image phenomenon71 infrared1)
   goals met: 11 of 68
27. (turn_to satellite0 planet11 phenomenon71)
   deleted: (pointing satellite0 phenomenon71)
   added: (pointing satellite0 planet11)
   goals met: 11 of 68
28. (take_image satellite0 planet11 instrument0 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 12 of 68
29. (turn_to satellite0 planet17 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet17)
   goals met: 12 of 68
30. (take_image satellite0 planet17 instrument0 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 13 of 68
31. (turn_to satellite0 planet18 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet18)
   goals met: 13 of 68
32. (take_image satellite0 planet18 instrument0 infrared3)
   added: (have_image planet18 infrared3)
   goals met: 14 of 68
33. (turn_to satellite0 planet36 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet36)
   goals met: 14 of 68
34. (take_image satellite0 planet36 instrument0 infrared1)
   added: (have_image planet36 infrared1)
   goals met: 15 of 68
35. (turn_to satellite0 planet41 planet36)
   deleted: (pointing satellite0 planet36)
   added: (pointing satellite0 planet41)
   goals met: 15 of 68
36. (take_image satellite0 planet41 instrument0 infrared1)
   added: (have_image planet41 infrared1)
   goals met: 16 of 68
37. (turn_to satellite0 planet52 planet41)
   deleted: (pointing satellite0 planet41)
   added: (pointing satellite0 planet52)
   goals met: 16 of 68
38. (take_image satellite0 planet52 instrument0 infrared1)
   added: (have_image planet52 infrared1)
   goals met: 17 of 68
39. (turn_to satellite0 planet57 planet52)
   deleted: (pointing satellite0 planet52)
   added: (pointing satellite0 planet57)
   goals met: 17 of 68
40. (take_image satellite0 planet57 instrument0 infrared3)
   added: (have_image planet57 infrared3)
   goals met: 18 of 68
41. (turn_to satellite0 planet61 planet57)
   deleted: (pointing satellite0 planet57)
   added: (pointing satellite0 planet61)
   goals met: 18 of 68
42. (take_image satellite0 planet61 instrument0 infrared1)
   added: (have_image planet61 infrared1)
   goals met: 19 of 68
43. (turn_to satellite0 planet72 planet61)
   deleted: (pointing satellite0 planet61)
   added: (pointing satellite0 planet72)
   goals met: 19 of 68
44. (take_image satellite0 planet72 instrument0 infrared3)
   added: (have_image planet72 infrared3)
   goals met: 20 of 68
45. (turn_to satellite0 star10 planet72)
   deleted: (pointing satellite0 planet72)
   added: (pointing satellite0 star10)
   goals met: 20 of 68
46. (take_image satellite0 star10 instrument0 infrared3)
   added: (have_image star10 infrared3)
   goals met: 21 of 68
47. (turn_to satellite0 star26 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star26)
   goals met: 21 of 68
48. (take_image satellite0 star26 instrument0 infrared1)
   added: (have_image star26 infrared1)
   goals met: 22 of 68
49. (turn_to satellite0 star27 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star27)
   goals met: 22 of 68
50. (take_image satellite0 star27 instrument0 infrared3)
   added: (have_image star27 infrared3)
   goals met: 23 of 68
51. (turn_to satellite0 star29 star27)
   deleted: (pointing satellite0 star27)
   added: (pointing satellite0 star29)
   goals met: 23 of 68
52. (take_image satellite0 star29 instrument0 infrared3)
   added: (have_image star29 infrared3)
   goals met: 24 of 68
53. (turn_to satellite0 star31 star29)
   deleted: (pointing satellite0 star29)
   added: (pointing satellite0 star31)
   goals met: 24 of 68
54. (take_image satellite0 star31 instrument0 infrared3)
   added: (have_image star31 infrared3)
   goals met: 25 of 68
55. (turn_to satellite0 star32 star31)
   deleted: (pointing satellite0 star31)
   added: (pointing satellite0 star32)
   goals met: 25 of 68
56. (take_image satellite0 star32 instrument0 infrared1)
   added: (have_image star32 infrared1)
   goals met: 26 of 68
57. (turn_to satellite0 star33 star32)
   deleted: (pointing satellite0 star32)
   added: (pointing satellite0 star33)
   goals met: 26 of 68
58. (take_image satellite0 star33 instrument0 infrared3)
   added: (have_image star33 infrared3)
   goals met: 27 of 68
59. (turn_to satellite0 star39 star33)
   deleted: (pointing satellite0 star33)
   added: (pointing satellite0 star39)
   goals met: 27 of 68
60. (take_image satellite0 star39 instrument0 infrared1)
   added: (have_image star39 infrared1)
   goals met: 28 of 68
61. (turn_to satellite0 star43 star39)
   deleted: (pointing satellite0 star39)
   added: (pointing satellite0 star43)
   goals met: 28 of 68
62. (take_image satellite0 star43 instrument0 infrared1)
   added: (have_image star43 infrared1)
   goals met: 29 of 68
63. (turn_to satellite0 star48 star43)
   deleted: (pointing satellite0 star43)
   added: (pointing satellite0 star48)
   goals met: 29 of 68
64. (take_image satellite0 star48 instrument0 infrared3)
   added: (have_image star48 infrared3)
   goals met: 30 of 68
65. (turn_to satellite0 star50 star48)
   deleted: (pointing satellite0 star48)
   added: (pointing satellite0 star50)
   goals met: 30 of 68
66. (take_image satellite0 star50 instrument0 infrared1)
   added: (have_image star50 infrared1)
   goals met: 31 of 68
67. (turn_to satellite0 star55 star50)
   deleted: (pointing satellite0 star50)
   added: (pointing satellite0 star55)
   goals met: 31 of 68
68. (take_image satellite0 star55 instrument0 infrared3)
   added: (have_image star55 infrared3)
   goals met: 32 of 68
69. (turn_to satellite0 star56 star55)
   deleted: (pointing satellite0 star55)
   added: (pointing satellite0 star56)
   goals met: 32 of 68
70. (take_image satellite0 star56 instrument0 infrared3)
   added: (have_image star56 infrared3)
   goals met: 33 of 68
71. (turn_to satellite0 star7 star56)
   deleted: (pointing satellite0 star56)
   added: (pointing satellite0 star7)
   goals met: 33 of 68
72. (take_image satellite0 star7 instrument0 infrared3)
   added: (have_image star7 infrared3)
   goals met: 34 of 68
73. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 34 of 68
74. (take_image satellite0 star9 instrument0 infrared1)
   added: (have_image star9 infrared1)
   goals met: 35 of 68
75. (turn_to satellite4 star2 planet38)
   deleted: (pointing satellite4 planet38)
   added: (pointing satellite4 star2)
   goals met: 35 of 68
76. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 35 of 68
77. (turn_to satellite4 phenomenon16 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon16)
   goals met: 35 of 68
78. (take_image satellite4 phenomenon16 instrument10 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 36 of 68
79. (turn_to satellite4 phenomenon28 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon28)
   goals met: 36 of 68
80. (take_image satellite4 phenomenon28 instrument10 spectrograph0)
   added: (have_image phenomenon28 spectrograph0)
   goals met: 37 of 68
81. (turn_to satellite4 phenomenon30 phenomenon28)
   deleted: (pointing satellite4 phenomenon28)
   added: (pointing satellite4 phenomenon30)
   goals met: 37 of 68
82. (take_image satellite4 phenomenon30 instrument10 thermograph2)
   added: (have_image phenomenon30 thermograph2)
   goals met: 38 of 68
83. (turn_to satellite4 phenomenon35 phenomenon30)
   deleted: (pointing satellite4 phenomenon30)
   added: (pointing satellite4 phenomenon35)
   goals met: 38 of 68
84. (take_image satellite4 phenomenon35 instrument10 spectrograph0)
   added: (have_image phenomenon35 spectrograph0)
   goals met: 39 of 68
85. (turn_to satellite4 phenomenon45 phenomenon35)
   deleted: (pointing satellite4 phenomenon35)
   added: (pointing satellite4 phenomenon45)
   goals met: 39 of 68
86. (take_image satellite4 phenomenon45 instrument10 thermograph2)
   added: (have_image phenomenon45 thermograph2)
   goals met: 40 of 68
87. (turn_to satellite4 phenomenon73 phenomenon45)
   deleted: (pointing satellite4 phenomenon45)
   added: (pointing satellite4 phenomenon73)
   goals met: 40 of 68
88. (take_image satellite4 phenomenon73 instrument10 thermograph2)
   added: (have_image phenomenon73 thermograph2)
   goals met: 41 of 68
89. (turn_to satellite4 phenomenon8 phenomenon73)
   deleted: (pointing satellite4 phenomenon73)
   added: (pointing satellite4 phenomenon8)
   goals met: 41 of 68
90. (take_image satellite4 phenomenon8 instrument10 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 42 of 68
91. (turn_to satellite4 planet20 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet20)
   goals met: 42 of 68
92. (take_image satellite4 planet20 instrument10 spectrograph0)
   added: (have_image planet20 spectrograph0)
   goals met: 43 of 68
93. (turn_to satellite4 planet21 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 planet21)
   goals met: 43 of 68
94. (take_image satellite4 planet21 instrument10 spectrograph0)
   added: (have_image planet21 spectrograph0)
   goals met: 44 of 68
95. (turn_to satellite4 planet22 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 planet22)
   goals met: 44 of 68
96. (take_image satellite4 planet22 instrument10 spectrograph0)
   added: (have_image planet22 spectrograph0)
   goals met: 45 of 68
97. (turn_to satellite4 planet25 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet25)
   goals met: 45 of 68
98. (take_image satellite4 planet25 instrument10 spectrograph0)
   added: (have_image planet25 spectrograph0)
   goals met: 46 of 68
99. (turn_to satellite4 planet34 planet25)
   deleted: (pointing satellite4 planet25)
   added: (pointing satellite4 planet34)
   goals met: 46 of 68
100. (take_image satellite4 planet34 instrument10 thermograph2)
   added: (have_image planet34 thermograph2)
   goals met: 47 of 68
101. (turn_to satellite4 planet38 planet34)
   deleted: (pointing satellite4 planet34)
   added: (pointing satellite4 planet38)
   goals met: 47 of 68
102. (take_image satellite4 planet38 instrument10 spectrograph0)
   added: (have_image planet38 spectrograph0)
   goals met: 48 of 68
103. (turn_to satellite4 planet4 planet38)
   deleted: (pointing satellite4 planet38)
   added: (pointing satellite4 planet4)
   goals met: 48 of 68
104. (take_image satellite4 planet4 instrument10 thermograph2)
   added: (have_image planet4 thermograph2)
   goals met: 49 of 68
105. (turn_to satellite4 planet44 planet4)
   deleted: (pointing satellite4 planet4)
   added: (pointing satellite4 planet44)
   goals met: 49 of 68
106. (take_image satellite4 planet44 instrument10 spectrograph0)
   added: (have_image planet44 spectrograph0)
   goals met: 50 of 68
107. (turn_to satellite4 planet5 planet44)
   deleted: (pointing satellite4 planet44)
   added: (pointing satellite4 planet5)
   goals met: 50 of 68
108. (take_image satellite4 planet5 instrument10 spectrograph0)
   added: (have_image planet5 spectrograph0)
   goals met: 51 of 68
109. (turn_to satellite4 planet53 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet53)
   goals met: 51 of 68
110. (take_image satellite4 planet53 instrument10 spectrograph0)
   added: (have_image planet53 spectrograph0)
   goals met: 52 of 68
111. (turn_to satellite4 planet54 planet53)
   deleted: (pointing satellite4 planet53)
   added: (pointing satellite4 planet54)
   goals met: 52 of 68
112. (take_image satellite4 planet54 instrument10 thermograph2)
   added: (have_image planet54 thermograph2)
   goals met: 53 of 68
113. (turn_to satellite4 planet58 planet54)
   deleted: (pointing satellite4 planet54)
   added: (pointing satellite4 planet58)
   goals met: 53 of 68
114. (take_image satellite4 planet58 instrument10 spectrograph0)
   added: (have_image planet58 spectrograph0)
   goals met: 54 of 68
115. (turn_to satellite4 planet59 planet58)
   deleted: (pointing satellite4 planet58)
   added: (pointing satellite4 planet59)
   goals met: 54 of 68
116. (take_image satellite4 planet59 instrument10 spectrograph0)
   added: (have_image planet59 spectrograph0)
   goals met: 55 of 68
117. (turn_to satellite4 planet60 planet59)
   deleted: (pointing satellite4 planet59)
   added: (pointing satellite4 planet60)
   goals met: 55 of 68
118. (take_image satellite4 planet60 instrument10 thermograph2)
   added: (have_image planet60 thermograph2)
   goals met: 56 of 68
119. (turn_to satellite4 planet65 planet60)
   deleted: (pointing satellite4 planet60)
   added: (pointing satellite4 planet65)
   goals met: 56 of 68
120. (take_image satellite4 planet65 instrument10 thermograph2)
   added: (have_image planet65 thermograph2)
   goals met: 57 of 68
121. (turn_to satellite4 planet69 planet65)
   deleted: (pointing satellite4 planet65)
   added: (pointing satellite4 planet69)
   goals met: 57 of 68
122. (take_image satellite4 planet69 instrument10 thermograph2)
   added: (have_image planet69 thermograph2)
   goals met: 58 of 68
123. (turn_to satellite4 planet70 planet69)
   deleted: (pointing satellite4 planet69)
   added: (pointing satellite4 planet70)
   goals met: 58 of 68
124. (take_image satellite4 planet70 instrument10 thermograph2)
   added: (have_image planet70 thermograph2)
   goals met: 59 of 68
125. (turn_to satellite4 star15 planet70)
   deleted: (pointing satellite4 planet70)
   added: (pointing satellite4 star15)
   goals met: 59 of 68
126. (take_image satellite4 star15 instrument10 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 60 of 68
127. (turn_to satellite4 star37 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star37)
   goals met: 60 of 68
128. (take_image satellite4 star37 instrument10 thermograph2)
   added: (have_image star37 thermograph2)
   goals met: 61 of 68
129. (turn_to satellite4 star40 star37)
   deleted: (pointing satellite4 star37)
   added: (pointing satellite4 star40)
   goals met: 61 of 68
130. (take_image satellite4 star40 instrument10 spectrograph0)
   added: (have_image star40 spectrograph0)
   goals met: 62 of 68
131. (turn_to satellite4 star47 star40)
   deleted: (pointing satellite4 star40)
   added: (pointing satellite4 star47)
   goals met: 62 of 68
132. (take_image satellite4 star47 instrument10 spectrograph0)
   added: (have_image star47 spectrograph0)
   goals met: 63 of 68
133. (turn_to satellite4 star6 star47)
   deleted: (pointing satellite4 star47)
   added: (pointing satellite4 star6)
   goals met: 63 of 68
134. (take_image satellite4 star6 instrument10 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 64 of 68
135. (turn_to satellite3 planet34 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 planet34)
   goals met: 65 of 68
136. (turn_to satellite4 phenomenon12 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 phenomenon12)
   goals met: 66 of 68
137. (turn_to satellite6 planet41 phenomenon28)
   deleted: (pointing satellite6 phenomenon28)
   added: (pointing satellite6 planet41)
   goals met: 67 of 68
138. (turn_to satellite7 star6 planet17)
   deleted: (pointing satellite7 planet17)
   added: (pointing satellite7 star6)
   goals met: 68 of 68
